// =============================================================================
// SRPG_BattleEndPatch.js
// Version: 0.02
// -----------------------------------------------------------------------------
// Copyright (c) 2018 ヱビ
// Released under the MIT license
// http://opensource.org/licenses/mit-license.php
// -----------------------------------------------------------------------------
// [Homepage]: ヱビのノート
//             http://www.zf.em-net.ne.jp/~ebi-games/
// =============================================================================


/*:
 * @plugindesc v0.02 戦闘後自動全体回復をOFFにしているとき、次の戦闘で待機状態で始まる不具合を修正します。
 * @author ヱビ
 * 
 *
 * @help
 * ============================================================================
 * 概要
 * ============================================================================
 * 
 * 神鏡学斗様のSRPGコンバータMV用プラグインです。
 * 
 * 戦闘後自動全体回復をOFFにしているとき、次の戦闘で待機状態で始まる不具合を修正します。
 * 
 * 
 * ============================================================================
 * 更新履歴
 * ============================================================================
 * 
 * Version 0.02
 *   パーティに入っていないアクターも含まれるように変更
 * 
 * Version 0.01
 *   
 * 
 * ============================================================================
 * 利用規約
 * ============================================================================
 * 
 * ・MITライセンスです。つまり↓↓
 * ・クレジット表記は不要
 * ・営利目的で使用可
 * ・改変可
 *     ただし、ソースコードのヘッダのライセンス表示は残してください。
 * ・素材だけの再配布も可
 * ・アダルトゲーム、残酷なゲームでの使用も可
 * 
 * 
 */

(function() {
//=============================================================================
// Game_System
//=============================================================================

//戦闘終了に関係する処理
    //戦闘終了するためのプラグイン・コマンド
	var _Game_System_prototype_endSRPG = Game_System.prototype.endSRPG;
    Game_System.prototype.endSRPG = function() {
		_Game_System_prototype_endSRPG.call(this);
		$gameActors._data.forEach(function(actor){
			actor.setSrpgTurnEnd(false);
		});
    };
})();